// eslint-disable-next-line import/prefer-default-export
export const Text = {
  register: {
    'register-title-top': 'آزمون',
    'register-title-bottom': 'خود را بسازید',
    'register-description':
      'برای ساخت آزمون، برگزاری در کلاس یا تعیین آن به‌عنوان تکلیف، و مشاهده گزارش عملکرد، وارد شوید یا ثبت‌نام کنید.',
    'register-signup': 'ثبت‌ نام',
    'register-login': 'ورود',
  },
  navbar: {
    'navbar-skip': 'رد کردن',
  },
  phone: {
    'register-phone-header': 'وقت ثبت‌نامه! بیا شروع کنیم!',
    'register-phone-default-number': '9192054609',
    'register-phone-default-pre-number': '+98',
    'register-phone-description-first': 'با ادامه دادن این مرحله، شما با ',
    'register-phone-description-terms-of-use': 'شرایط استفاده ',
    'register-phone-description-and': 'و ',
    'register-phone-description-privacy-policy': 'سیاست حفظ حریم خصوصی ما ',
    'register-phone-description-end': ' موافقت می‌کنید.',
  },
  google: {
    'google-header': 'یا',
    'google-auth': 'ورود با Google',
  },
  codeOTP: {
    'code-header': 'کدی که برات پیامک کردیم رو وارد کن.',
    'code-sub': 'نگرفتی؟',
    'code-sub-link': 'دوباره بفرست.',
  },
  Name: {
    'name-header': 'اسمت چیه؟',
    'name-input-first-name': 'نام',
    'name-input-last-name': 'نام خانوادگی',
    'name-input-user-name': 'اسم نمایشی',
    'name-user-name-header': 'خیلیا یه اسم خفن  هم واسه خودشون می‌سازن!',
    'name-warning1': 'نباید فاصله داشته باشه',
    'name-warning2': 'حداقل ۳ حرف باشه',
    'name-warning3': 'فقط از حروف، اعداد و _ استفاده شه',
  },
  Username: {
    'username-header': 'نام کاربری',
    'username-username': '@katatonia',
    'username-another': 'تغییر نام کاربری',
  },
  age: {
    'age-header': 'چند سالته؟',
    'age-min': '7',
    'age-max': '60',
    'age-description': 'نگران نباش! فقط برای تنظیمات بهتر استفاده می‌شه، نه برای نمایش به دیگران.',
    'age-initial-text': 'برای انتخاب بازه سنی،همین اهرم را بکشید',
  },
  photo: {
    'photo-header': 'تصویر اضافه کن!',
  },
  userType: {
    'type-header': 'نقش شما در دانامیت چیه؟',
    'type-type1': 'تفریحی / سرگرمی',
    'type-type2': 'سازمان / کسب‌وکار',
    'type-type3': 'معلم / استاد',
    'type-type4': 'دانش‌آموز / دانشجو',
  },
  topics: {
    'topics-header': 'چه موضوع‌هایی برات جذاب‌ترن؟',
    'topics-description':
      'موضوع‌هایی رو انتخاب کن که بیشتر دوست داری؛ تا بازی‌ها و آزمون‌های جالب‌تری برات آماده کنیم!',
    'topics-id1': '📐 ریاضی و فیزیک',
    'topics-id2': '🔬علوم تجربی و زیست',
    'topics-id3': '📚 تاریخ',
    'topics-id4': '📖‍️ ادبیات',
    'topics-id5': '🔤 زبان انگلیسی',
    'topics-id6': '🧩 هوش و معما',
    'topics-id7': '💻 کامپیوتر و فناوری',
    'topics-id8': '🖌️ کامیک و انیمه',
    'topics-id9': '🐳 دنیای حیوانات',
    'topics-id10': '🎨 هنر و نقاشی',
    'topics-id11': '🌙 نجوم و فضا',
    'topics-id12': '🎬 سینما و سریال',
    'topics-id13': '🏀️ ورزش',
    'topics-id14': '🌍 جغرافیا',
    'topics-id15': '🎮 بازی های کامپیوتری',
    'topics-id16': '💰 اقتصاد',
    'topics-id17': '🧘‍️ روانشناسی و ذهن',
    'topics-id18': '🎧 موسیقی',
    'topics-id19': '🦸‍️ شخصیت‌ها',
    'topics-id20': '🏯 فرهنگ‌ها و کشورها',
  },
  email: {
    'email-header': 'می‌خوای ایمیلت رو هم اضافه کنی؟',
    'email-description': `این کاملاً اختیاریه، ولی اگه خواستی باهات در تماس باشیم
(مثلاً برای بازی‌های جدید یا بازیابی حسابت)،
ایمیلت رو وارد کن`,
    'email-input': 'Email',
  },
};
